In [1]:
import io

import pandas as pd

In [2]:
data = '''Name|Age|Color
Fred|22|Red
Sally|29|Blue
George|24|
Fido||Black'''

df = pd.read_table(io.StringIO(data), sep='|')

In [3]:
df

     Name  Age  Color
0    Fred   22    Red
1   Sally   29   Blue
2  George   24    NaN
3    Fido  NaN  Black

## Dealing with NaN

In [47]:
df

     Name  Age  Color
0    Fred   22    Red
1   Sally   29   Blue
2  George   24    NaN
3    Fido  NaN  Black

In [48]:
df.isnull()

    Name    Age  Color
0  False  False  False
1  False  False  False
2  False  False   True
3  False   True  False

In [49]:
df.Age.isnull()

0    False
1    False
2    False
3     True
Name: Age, dtype: bool

In [50]:
df[df.Age.isnull()]

   Name  Age  Color
3  Fido  NaN  Black

In [51]:
df[~df.Age.isnull()]

     Name  Age Color
0    Fred   22   Red
1   Sally   29  Blue
2  George   24   NaN

In [52]:
df.dropna()

    Name  Age Color
0   Fred   22   Red
1  Sally   29  Blue

In [54]:
df.dropna(subset=['Age'])

     Name  Age Color
0    Fred   22   Red
1   Sally   29  Blue
2  George   24   NaN

In [55]:
df.fillna(-1)

     Name  Age  Color
0    Fred   22    Red
1   Sally   29   Blue
2  George   24     -1
3    Fido   -1  Black

In [56]:
df['Color'] = df.Color.fillna('missing')

In [57]:
df

     Name  Age    Color
0    Fred   22      Red
1   Sally   29     Blue
2  George   24  missing
3    Fido  NaN    Black